# ☝️ CRUD: Create => Read => Update => Delete

> CRUD（クラッド）とは、ほとんど全てのコンピュータソフトウェアが持つ永続性[1]の4つの基本機能のイニシャルを並べた用語。その4つとは、Create（生成）、Read（読み取り）、Update（更新）、Delete（削除）である。ユーザインタフェースが備えるべき機能（情報の参照/検索/更新）を指す用語としても使われる。
>
> https://ja.wikipedia.org/wiki/CRUD

## 1. 初期設定

Jupyter Notebook を再起動した場合などは pip install から実行してください

In [3]:
! pip install ipython-sql pymysql
%load_ext sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.7/site-packages (0.3.9)
Requirement already satisfied: pymysql in /opt/conda/lib/python3.7/site-packages (0.9.3)
Requirement already satisfied: six in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (1.3.1)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (7.3.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (0.3.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /opt/conda/lib/python3.7/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (40.8.0)
Requirement already satisfied: jedi>=0.10 in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.13.3)
Requirement already satisfied: decorator in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: prompt_toolkit<2.1.0,>=2.0.0 in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.0.9)
Requirement already satisfied: pygments in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.3.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: pexpect in /opt/conda/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.6.0)
Requirement already satisfied: parso>=0.3.0 in /opt/conda/lib/python3.7/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.3.4)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.7/site-packages (from prompt_toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.7/site-packages (from pexpect->ipython>=1.0->ipython-sql) (0.6.0)

## 2. 接続確認

In [21]:
%%sql mysql+pymysql://hello:world@10.0.1.100/employees
select 'hello' as world

1 rows affected.

[('hello',)]

## 3. 一時テーブルの作成

この演習で使用している `hello` ユーザーには `employees` データベースの読み取り権限のほか一時的なテーブルを作成することができる `tmp` データベースへのアクセス権限を付与してあります。このノートブックでは `tmp` データベースを使って、データを格納・更新・削除するための方法を確認していきます。

以下のクエリを実行することで一時的なテーブルを作成することができます。`<データベース名>.<テーブル名>` のようにテーブル名を指定することで別のデータベースにあるテーブルを指定できます。

In [27]:
%%sql
create temporary table tmp.hello (
    id int,
    value text
)

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

## 4. レコードの追加

INSERT 文を利用することでテーブルにレコードを追加することができます。

In [39]:
%%sql
insert into tmp.hello values (10, "item-1"), (20, "item-2");

select * from tmp.hello;

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.
6 rows affected.

[(10, 'item-1'),
 (20, 'item-2'),
 (10, 'item-1'),
 (20, 'item-2'),
 (10, 'item-1'),
 (20, 'item-2')]

## 5. CTAS: CREATE TABLE AS

多くのクエリエンジンには `CREATE TABLE` でテーブルを作成する際に SELECT 文の実行結果をそのまま格納できる `CREATE TABLE AS` (CTAS) という機能が用意されています。以下は `employees` テーブルから `emp_no` が `10005` 未満の社員情報を `tmp.new_employees` テーブルに格納するクエリです。データの型情報なども引き継がれるので別のサーバーにあるテーブル情報を丸っと移動したいときに便利です。

In [34]:
%%sql
create temporary table tmp.new_employees as
select
    *
from
    employees
where
    emp_no  < 10005
;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
4 rows affected.
4 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))]

`INSERT` 文も `SELECT` 文の実行結果をそのまま挿入する構文があります。以下は先ほど作ったテーブルに `employees` から `emp_no` が `499997` 以上のレコードを追加するクエリです。

In [38]:
%%sql
insert into tmp.new_employees
select * from employees where emp_no >= 499997;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.
10 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))]

## 6. レコードの更新

`UPDATE` 文を利用することでレコードを更新することができます。